ATsupportum/src/Catalogs/БазыДанных_ат/БазыДанных_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных_ат</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервереДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/БазыДанных_ат/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПодключения(Команда)
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("Наименование",	 Объект.Наименование);
	СтруктураПодключения.Вставить("ФайловыйРежим",	 Объект.ТипИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("КаталогИБ",		 Объект.КаталогИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ИмяСервера",		 Объект.ИмяСервераИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ИмяИБНаСервере",	 Объект.ИмяИнформационнойБазыНаСервереДляПодключения);
	СтруктураПодключения.Вставить("Пользователь",	 Объект.ПользовательИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("Пароль",			 Объект.ПарольИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ВерсияПлатформы", Объект.ВерсияПлатформыИнформационнойБазыДляПодключения); 
	
	РезультатПодключения = ПодключитьсяКИнформационнойБазе(СтруктураПодключения);
	
	Если РезультатПодключения = "Успешно" Тогда 
		Сообщить("Подключение к информационной базе произошло успешно", СтатусСообщения.Информация);
	Иначе
		Сообщить(РезультатПодключения, СтатусСообщения.Важное);
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция   ПодключитьсяКИнформационнойБазе(СтруктураПодключения)
	
	РезультатПодключения = ПодключениеКИБ_ат.ПодключитьсяКИнформационнойБазе(СтруктураПодключения);
	
	Если ТипЗнч(РезультатПодключения) = Тип("COMОбъект") Тогда
		Возврат "Подключение к информационной базе произошло успешно.";
	Иначе
		Возврат РезультатПодключения;
	КонецЕсли;

КонецФункции	

&НаКлиенте
Процедура ТипИнформационнойБазыДляПодключенияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовУправления()
	
	Если Объект.ТипИнформационнойБазыДляПодключения Тогда
		ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ТекущаяСтраница = ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ПодчиненныеЭлементы.ПодключениеФайловаяИБ;
	Иначе
		ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ТекущаяСтраница = ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ПодчиненныеЭлементы.ПодключениеСервернаяИБ;
	КонецЕсли;
	                                                                     
КонецПроцедуры
